---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError
source: html/f8db6aee-7a19-d798-8aa9-871c8fdfd234.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError Property

The specified angles are not compatible with current layout.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutError { get; }
```